# .zsh_plugins.txt

# powerlevel10k prompt
romkatv/powerlevel10k

# window title
olets/zsh-window-title

# oh-my-zsh plugins / libs
ohmyzsh/ohmyzsh path:lib/grep.zsh
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh

# fzf tab completion and history search
Aloxaf/fzf-tab
joshskidmore/zsh-fzf-history-search 

# zsh-users plugins
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting
