# .zsh_plugins.txt

# powerlevel10k prompt
romkatv/powerlevel10k

# oh-my-zsh plugins / libs
ohmyzsh/ohmyzsh path:lib/grep.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh
ohmyzsh/ohmyzsh path:lib/theme-and-appearance.zsh

# prezto completion
sorin-ionescu/prezto path:modules/completion

# window title
olets/zsh-window-title

# abbrevations
# olets/zsh-abbr 

# zsh-users plugins
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
zsh-users/zsh-syntax-highlighting
